---
kind: property
id: P:Autodesk.Revit.DB.Sweep.Path3d
source: html/c61556c8-000d-028f-e18e-d2fbe71ff425.htm
---
# Autodesk.Revit.DB.Sweep.Path3d Property

The selected curves used for the sweep path.

## Syntax (C#)
```csharp
public Path3d Path3d { get; }
```

## Remarks
If the sweep is based on a sketched path, this property is Nothing nullptr a null reference ( Nothing in Visual Basic) .